{
"missing_confidentiality": "Confidentiality. Each party shall keep Confidential Information secret, use it only to perform this Agreement, and protect it using reasonable safeguards. Exceptions include information that is publicly available without breach, already known without duty of confidentiality, independently developed, or disclosed under court order.",
"missing_governing_law": "Governing Law; Venue. This Agreement is governed by the laws of the State of Delaware, without regard to its conflicts of laws principles. The parties consent to the exclusive jurisdiction and venue of the state and federal courts located in Delaware.",
"uncapped_liability": "Limitation of Liability. Except for a party's willful misconduct, gross negligence, or breach of confidentiality, in no event will either party's aggregate liability exceed the fees paid or payable under this Agreement in the twelve (12) months preceding the claim. Neither party will be liable for indirect, incidental, special, or consequential damages.",
"missing_indemnity": "Indemnification. Each party shall indemnify, defend, and hold harmless the other party from third-party claims arising from the indemnifying party's breach of this Agreement, violation of law, or willful misconduct, including reasonable attorneys' fees and costs.",
"missing_ip": "Intellectual Property; Ownership. Each party retains ownership of its pre-existing IP. Deliverables specifically identified as Work Product will be owned by [Client], and [Vendor] hereby assigns all right, title, and interest in such Work Product, subject to a non-exclusive, royalty-free license to background materials as necessary for use.",
"autorenew_gt_12m": "Renewal. The Initial Term shall be one (1) year. Thereafter, this Agreement renews for consecutive one-year terms unless either party gives at least thirty (30) days' written notice of non-renewal before the end of the then-current term.",
"no_termination_conv": "Termination for Convenience. Either party may terminate this Agreement for convenience upon thirty (30) days' prior written notice. Upon termination, each party will return or destroy the other party's Confidential Information.",
"venue_mismatch": "Forum Selection. The parties agree that any dispute shall be brought exclusively in the state or federal courts located in Delaware, and each party consents to personal jurisdiction there.",
"no_carveouts": "Confidentiality Exceptions. The obligations in this Section do not apply to information that is or becomes public without breach, known to the receiving party without duty, independently developed, or disclosed pursuant to a valid court order or legal requirement (with prompt notice and cooperation where legally permitted).",
"no_injunctive_relief": "Equitable Relief. The parties agree that a breach of confidentiality or IP obligations may cause irreparable harm for which monetary damages are inadequate, and that the non-breaching party may seek injunctive relief without posting bond."
}